export const initialCategories = [
    "ผลผลิต",
    "ประสิทธิภาพ",
    "ทักษะในการจัดการ",
    "การเรียนรู้และพัฒนา",
    "การสื่อสาร",
    "ความสัมพันธ์",
    "การเข้าร่วม"
];

export const initialQuestions = [
    { id: 'ans1', category: 'ผลผลิต', text: 'ทำงานให้ครบตามปริมาณที่กำหนดไว้และบรรลุเป้าหมายที่ตั้งไว้' },
    { id: 'ans2', category: 'ผลผลิต', text: 'ปฏิบัติหน้าที่และความรับผิดชอบอย่างครบถ้วนและเชื่อถือได้' },
    { id: 'ans3', category: 'ผลผลิต', text: 'มีส่วนร่วมในการบรรลุเป้าหมายและลำดับความสำคัญของแผนก' },
    { id: 'ans4', category: 'ประสิทธิภาพ', text: 'ส่งมอบผลิตภัณฑ์ โครงการ ขั้นตอน และบริการที่มีคุณภาพสูง พร้อมแสดงเจตนารมณ์ในการปรับปรุงอย่างต่อเนื่อง' },
    { id: 'ans5', category: 'ประสิทธิภาพ', text: 'เป็นคนคล่องแคล่ว และมีความคิดสร้างสรรค์ / แปลกใหม่ในการทำงาน' },
    { id: 'ans6', category: 'ประสิทธิภาพ', text: 'ตัดสินใจเรื่องงานได้ทันท่วงทีและถูกต้อง' },
    { id: 'ans7', category: 'ทักษะในการจัดการ', text: 'วางแผน, กำหนดลำดับความสำคัญและจัดระเบียบงานอย่างเหมาะสม' },
    { id: 'ans8', category: 'ทักษะในการจัดการ', text: 'ระบุและใช้ทรัพยากรอย่างมีประสิทธิภาพและรับผิดชอบ' },
    { id: 'ans9', category: 'ทักษะในการจัดการ', text: 'มีความสามารถในการตั้งเป้าหมายด้วยตนเองและทำงานได้ดีภายใต้การดูแลน้อย' },
    { id: 'ans10', category: 'การเรียนรู้และพัฒนา', text: 'แสดงความยืดหยุ่นและปรับตัวได้ดีต่อการเปลี่ยนแปลง' },
    { id: 'ans11', category: 'การเรียนรู้และพัฒนา', text: 'ยอมรับความรับผิดชอบต่อการกระทำของตนเอง และเรียนรู้จากประสบการณ์อย่างต่อเนื่อง' },
    { id: 'ans12', category: 'การเรียนรู้และพัฒนา', text: 'แสดงให้เห็นถึงการเรียนรู้อย่างต่อเนื่อง โดยติดตามพัฒนาการใหม่ ๆ และรับทักษะใหม่ที่เกี่ยวกับงาน' },
    { id: 'ans13', category: 'การสื่อสาร', text: 'สื่อสารอย่างชัดเจนและมีประสิทธิภาพ ทั้งทางวาจาและลายลักษณ์อักษร' },
    { id: 'ans14', category: 'การสื่อสาร', text: 'รับและให้ข้อเสนอแนะอย่างสร้างสรรค์' },
    { id: 'ans15', category: 'การสื่อสาร', text: 'ใช้ช่องทางการสื่อสารที่เหมาะสมเพื่อถ่ายทอดและเผยแพร่ข้อมูล, ความคิดอย่างทันท่วงที' },
    { id: 'ans16', category: 'ความสัมพันธ์', text: 'มีส่วนร่วมอย่างแข็งขันและมีส่วนช่วย โดยทำงานเป็นส่วนหนึ่งของทีมอย่างมีประสิทธิภาพ' },
    { id: 'ans17', category: 'ความสัมพันธ์', text: 'สร้างความสัมพันธ์ความร่วมมือในการทำงาน และช่วยแก้ไขความขัดแย้งในที่ทำงาน' },
    { id: 'ans18', category: 'ความสัมพันธ์', text: 'ส่งเสริมและสนับสนุนความหลากหลาย แสดงความเคารพผู้อื่น ให้การปฏิบัติที่ยุติธรรมและเหมาะสมต่อทุกคน' },
    { id: 'ans19', category: 'การเข้าร่วม', text: 'มาทำงานตรงเวลาเป็นประจำ' },
    { id: 'ans20', category: 'การเข้าร่วม', text: 'ปฏิบัติตามขั้นตอนเมื่อลางานประจำ / ลาพักร้อน หรือยื่นคำอธิบายเหตุผล' }
];

export const mockDepartments = [
    { id: 1, name: "บัญชี" },
    { id: 2, name: "ทรัพยากรบุคคล" },
    { id: 3, name: "การปฏิบัติการ" },
    { id: 4, name: "เทคโนโลยี" }
];

export const mockEmployees = [
    { id: 1, name: "พนักงาน 1", title: "นักศึกษาฝึกงาน", deptId: 1 },
    { id: 2, name: "พนักงาน 2", title: "รองหัวหน้าแผนก", deptId: 1 },
    { id: 3, name: "พนักงาน 3", title: "พนักงาน", deptId: 2 },
    { id: 4, name: "พนักงาน 4", title: "พนักงาน", deptId: 2 },
    { id: 5, name: "พนักงาน 5", title: "พนักงาน", deptId: 2 },
    { id: 6, name: "พนักงาน 6", title: "นักศึกษาฝึกงาน", deptId: 4 },
    { id: 7, name: "พนักงาน 7", title: "พนักงานฝ่ายเทคนิค", deptId: 4 },
    { id: 8, name: "พนักงาน 8", title: "พนักงานฝ่ายเทคนิค", deptId: 3 },
    { id: 9, name: "พนักงาน 9", title: "พนักงาน", deptId: 3 },
    { id: 10, name: "พนักงาน 10", title: "พนักงาน", deptId: 4 },
    { id: 11, name: "พนักงาน 11", title: "รองหัวหน้าแผนก", deptId: 4 }
];

/**
 * 1 = ต่ำกว่าเกณฑ์ (Under Performing) => 20%
 * 2 = ต่ำกว่าความคาดหวัง (Below Expectations) => 40%
 * 3 = ได้ตามความคาดหวัง (Meets Expectations) => 60%
 * 4 = เกินความคาดหวัง (Exceeds Expectations) => 80%
 * 5 = ยอดเยี่ยม (Excellent) => 100%
 */

// We will hold mock past assessments here
export const mockEvaluations = [
    { evId: 1, empId: 11, score: 92.5, date: '2023-01-15' },
    { evId: 2, empId: 1, score: 83.0, date: '2023-02-12' },
    { evId: 3, empId: 7, score: 79.0, date: '2023-03-05' },
    { evId: 4, empId: 4, score: 45.0, date: '2023-04-20' },
    { evId: 5, empId: 9, score: 46.0, date: '2023-05-18' }
];
